import React from "react";
import LayoutWithImage from "./LayoutWithImage";
import Signature from "./Signature";
import Section from "./Section";
import { FaBook, FaRegBuilding, FaUser, FaUsers } from "react-icons/fa";
import ScrollArrow from "./ScrollArrow";
import myImg from "../../imgs/me/img16.jpg";
import myImg2 from "../../imgs/me/img6.jpg";
import myImg4 from "../../imgs/me/img8.jpg";
import myImg5 from "../../imgs/me/img9.jpg";
import myImg6 from "../../imgs/me/img10.jpg";
import myImg7 from "../../imgs/me/img11.jpg";
import myImg8 from "../../imgs/me/img12.jpg";
import myImg9 from "../../imgs/me/img15.jpg";
import myImg10 from "../../imgs/me/img17.jpg";
import myImgqsm1 from "../../imgs/qsm/img1.jpg";
import myImgqsm2 from "../../imgs/qsm/img3.jpg";
import myImgqsm3 from "../../imgs/qsm/img5.jpg";
import myImg2me1 from "../../imgs/me2/Image7.jpg";
import myImg2me2 from "../../imgs/me2/Image6.jpg";
import myImg2me3 from "../../imgs/me2/Image5.jpg";
import myImg2me4 from "../../imgs/me2/Image4.jpg";
import myImg2me5 from "../../imgs/me2/Image3.jpg";
import myImg2me6 from "../../imgs/me2/Image1.jpg";
import myImg2me7 from "../../imgs/me2/Image2.jpg";
import myImg2me8 from "../../imgs/me2/Image10.jpg";
import myImg2me9 from "../../imgs/me2/Image9.jpg"; 
import myImgtaalom1 from "../../imgs/markez-taalom/img14.jpg";
import myImgtatbeqat1 from "../../imgs/tatbeqat/img1.jpg";
import myImgtatbeqat2 from "../../imgs/tatbeqat/img2.jpg";
import myImgtatbeqat3 from "../../imgs/tatbeqat/img4.jpg";
import myImgodt1 from "../../imgs/ODT/img4.jpg";
import myImgodt2 from "../../imgs/ODT/img7.jpg";
import myImgodt3 from "../../imgs/ODT/img9.jpg";

import { FaChalkboardTeacher } from "react-icons/fa";
import imgPlaceholder from "../../imgs/img-ph-150.png";
import { FaChartLine } from "react-icons/fa";
import { FaHandsHelping } from "react-icons/fa";
import { FaSchool } from "react-icons/fa";
import { FaCalendarAlt } from "react-icons/fa";
import { FaUserTie } from "react-icons/fa";
import { FaFrown } from "react-icons/fa";
import { FaSmile } from "react-icons/fa";
import { FaCalendarDay } from "react-icons/fa";
import { FaCalendarCheck } from "react-icons/fa";

const sections = [
  {
    id: "whoami-section",
    icon: <FaUser size={30} />,
    title: "من أنا",
    text: `
      اسمي محمود إبراهيم اغبارية، أبلغ من العمر 26 عامًا وأعيش في قرية مشيرفة التي تطل على مرج ابن عامر. أدرس في كلية القاسمي في باقة الغربية، حيث دخلت تخصصي علوم الحاسوب والتربية غير المنهجية، للسنة الدراسية 2024/2023. أؤمن بأن الحياة مليئة بالفرص والتحديات، وكل تحدٍ هو فرصة للتعلم والتطور.
    `,
    images: [
      { src: myImg2, alt: "myImg2" },
      { src: myImg2me7, alt: "Sample Image 2" },
      { src: myImg2me8, alt: "Sample Image 3" },
      { src: myImg2me9, alt: "Sample Image 4" },
    ],
  },
  {
    id: "id2",
    icon: <FaBook size={30} />,
    title: "التعليم",
    text: `
      أثناء دراستي في الكلية، كنت منخرطًا في العديد من الأنشطة الأكاديمية والاجتماعية، مما ساعدني على تطوير مهاراتي القيادية والتنظيمية.
وخلال هذه المدة، تعلمت لغات البرمجة مثل "C#", "Java", "HTML" و "C++"، وتعمقت في مجال الحماية وأنظمة التشغيل، متعلمًا لغات مثل "Linux" و "DOS".
بفضل التزامي واجتهادي، تمكنت من تحقيق إنجازات متميزة عادةً ما تتطلب أربع إلى خمس سنوات، خلال فترة زمنية لا تتجاوز السنتين فقط. `,
images: [
  { src: myImgqsm1, alt: "myImg2" },
  { src: myImgqsm2, alt: "Sample Image 2" },
  { src: myImgqsm3, alt: "Sample Image 3" },
  { src: myImg2me5, alt: "Sample Image 4" },
],
  },
  {
    id: "id3",
    icon: <FaRegBuilding size={30} />,
    title: "الخبرة",
    text: `
       بعد إتمام دراستي الثانوية، بدأت تعلم مهنة سائق إسعاف في "نجمة داود الحمراء"، وكانت هذه خطوتي الأولى لتحقيق هدفي في أحد المجالات العديدة التي اطمح اليها.
خلال عملي في هذا المجال، تعلمت أهمية الحياة البشرية وعزز من قيمتي الإنسانية والرضاء في القدر *خيره وشره*, شخصيتي مبنية على التعلم المستمر لشتى المجالات ومختلفها.  وها انا من موقفي هذا أتطلع الى مراحل قادمة اصبو من خلالها تعلم مجالات اخرى ومواضيع مختلفة جديدة.`,
images: [
  { src: myImg2me1, alt: "myImg2" },
  { src: myImg2me2, alt: "Sample Image 2" },
  { src: myImg2me3, alt: "Sample Image 3" },
  { src: myImg2me4, alt: "Sample Image 4" },
],
  },
  {
    id: "id4",
    icon: <FaUsers size={30} />,
    title: "الاهتمامات",
    text: `
تعد الهوايات والاهتمامات جزءًا لا يتجزأ من شخصيتي ومن رحلتي التعليمية والمهنية.
أجد شغفي في ممارسة كرة القدم والكاليسثنكس، حيث أستمتع بتحدي نفسي وتحقيق أهداف جديدة في اللياقة البدنية، مما يعزز صحتي البدنية وقدرتي على التركيز والانضباط.
السفر هو شغفي الآخر، حيث يفتح لي أبوابًا لفهم أعمق للعالم من حولي عبر اكتشاف ثقافات جديدة والتفاعل مع مجتمعات متنوعة، مما يعزز قدرتي على التفكير النقدي والتواصل الفعّال.
 القراءة توسع مداركي وتثري معرفتي، سواء في مجالات تخصصي أو مجالات جديدة تضيف إلى شخصيتي وتطويري المهني.
أؤمن بأن تنظيم الوقت هو مفتاح النجاح في الحياة، حيث أتمكن من الموازنة بين الدراسة والتطبيق العملي والهوايات، مما يتيح لي تحقيق أهدافي بكفاءة ويساهم في نجاحي الأكاديمي والمهني.    `,
images: [
  { src: myImg2me6, alt: "myImg2" },
  { src: myImgodt1, alt: "Sample Image 2" },
  { src: myImgodt2, alt: "Sample Image 3" },
  { src: myImgodt3, alt: "Sample Image 4" },
],
  },
  {
    id: "id5",
    icon: <FaChalkboardTeacher size={30} />,
    title: "لماذا اخترت مهنة التعليم",
    text: `
اخترت مهنة التعليم لأنها أساس المهن. سأروي قصة توضح هذا المفهوم: كان هناك ملك يحب المباني الكبيرة ولكن يكره رؤية الأعمدة في وسطها. جاء مهندس من بلاد بعيدة ووعد ببناء مبنى بدون أعمدة. وعند الانتهاء، دهش الملك وسأل المهندس عن السر. أخبره المهندس أن هناك حجر أساس مخفي في زاوية المبنى يقوم بدور الأعمدة. وهذا هو دور المعلم الذي أطمح إليه، أن أكون حجر الأساس الذي يرفع المهن الأخرى بدون أن يكون مرئيًا أو موقعًا للمديح.

ومن ناحية أخرى، يأتي دور المهندس الذي يمثل دور المرشد وفي قصتي نلقي الضوء على (مرشدتي فاطمة) التي ثابرت وأدت دورها لتكون هي المهندس العبقري الذي أثمر وأعد حجر الأساس, فيمكنني الحديث بدون كلل عن تفانيها وحسن نواياها ولا يمكن نكران كونها جزء في اعداد وهندسة احد معلمي المستقبل ان شاء الله. 
والعمل بجد لتحقيق أهدافي وأهداف الفريق الذي أعمل معه. أنا على ثقة بأن مهاراتي وخبراتي ستضيف قيمة حقيقية إلى أي مكان أكون فيه, وإنني ملتزم بتقديم أفضل ما لدي في كل موقف.`,
images: [
  { src: myImgtaalom1, alt: "myImg2" },
  { src: myImgtatbeqat1, alt: "Sample Image 2" },
  { src: myImgtatbeqat2, alt: "Sample Image 3" },
  { src: myImgtatbeqat3, alt: "Sample Image 4" },
],
  },
  {
    id: "id5",
    icon: <FaChartLine size={30} />,
    title: "توقعاتي من نفسي",
    text: `
أتوقع من نفسي أن أكون ملتزمًا ومتحمسًا خلال مرحلة التطبيقات العلمية لمهنة المعلم. سأعمل بجد لتطبيق ما تعلمته نظريًا في سنتي الاولى وفي البيئة التعليمية التي تحوي تاقما ايداريا من محاضرين اكفائ، ومع التركيز على تطوير مهاراتي التربوية والعملية. أتوقع أن أكون مبدعًا في تقديم الدروس، متفاعلاً مع الطلاب، وقادرًا على إيجاد حلول فعّالة للتحديات التي قد تواجهني. كما أنني أسعى لتحسين مهاراتي في إدارة الصف والتواصل مع الطلاب والزملاء وألمرشدين    `,
  },
  {
    id: "id5",
    icon: <FaHandsHelping size={30} />,
    title: "توقعاتي من المرشدة",
    text: `
أتوقع من المرشدة أن تقدم لي الدعم والتوجيه اللازمين خلال فترة التطبيقات. أحتاج إلى ملاحظاتها البناءة وتوجيهاتها المستندة إلى خبرتها الواسعة في الميدان التعليمي. أتوقع أن تكون صبورة ومستعدة للإجابة على أسئلتي، وأن تساعدني في تطوير استراتيجيات تعليمية فعالة. كما أنني أتطلع إلى الحصول على نصائح عملية تساعدني في تحسين أدائي وتطوير مهاراتي التربوية.    `,
  },
  {
    id: "id5",
    icon: <FaSchool size={30} />,
    title: "توقعاتي من المدرسة",
    text: `
أتوقع من المدرسة أن توفر لي بيئة تعليمية ملهمة وآمنة تساعدني على تطبيق ما تعلمته بشكل عملي. أحتاج إلى الدعم من جميع الأطراف المعنية، بدءًا من الإدارة وحتى الطاقم التعليمي. أتوقع أن تكون المدرسة متعاونة ومرحبة، وأن تمنحني الفرصة لتجربة أساليب تعليمية مختلفة. كما أتوقع الحصول على الموارد اللازمة مثل الأدوات التعليمية والمواد الدراسية التي تساعدني في تقديم دروس فعالة    `,
  },
  {
    id: "id5",
    icon: <FaUserTie size={30} />,
    title: "توقعاتي من المعلم المدرب",
    text: `
أتوقع من المعلم المدرب أن يكون نموذجًا يحتذى به في مهنة التعليم. أحتاج إلى مشاركته لخبراته العملية وأساليبه التربوية الناجحة. أتوقع أن يقدم لي ملاحظات فورية ومفصلة عن أدائي في الفصل، وأن يساعدني في تطوير خطط دروس فعالة. كما أتطلع إلى أن يكون داعمًا ومشجعًا، ويعطيني الفرصة لتجربة أفكاري التعليمية الجديدة تحت إشرافه.    `,
  },
  {
    id: "id5",
    icon: <FaCalendarAlt size={30} />,
    title: "توقعاتي من السنة الدراسية الأكاديمية",
    text: `
أتوقع من السنة الدراسية الأكاديمية أن تكون فترة تعليمية مكثفة ومثمرة. أتطلع إلى تطبيق النظريات التربوية في بيئة صفية فعلية واكتساب خبرة عملية واسعة. أتوقع أن أتعلم كيفية التعامل مع تحديات الصف المختلفة، وأن أطور مهاراتي في التخطيط والتنفيذ والتقييم. كما أنني أتوقع تحقيق تقدم ملحوظ في مسيرتي التعليمية وأن أكون جاهزًا لمواجهة متطلبات مهنة التعليم بعد انتهاء فترة التطبيقات.    `,
  },
  {
    id: "id5",
    icon: <FaFrown size={30} />,
    title: "مواقف واعتبارات",
    text: `
في بداية فترة التطبيقات، تم تخصيص غرفة خاصة لنا كطلاب تطبيقات، وهي غرفة كانت خاصة بمعلمي الحاسوب فقط. بناءً على ذلك، تم السماح لنا باستخدامها كنقطة تجمع وأساس أثناء الدوام. لكن تم تنبيهنا على أهمية المحافظة على نظافة الغرفة حيث تُعقد فيها بعض الاجتماعات الهامة.

بعد فترة من الزمن، ومع مرور أيام التطبيقات بشكل عادي، حدث سوء فهم بسيط أدى إلى توكيلنا ذنب وجود بعض المهملات في الغرفة، بغض النظر عما إذا كنا نحن من ترك المهملات أم لا. تقبلنا الأمر بروح المعلمين المستقبليين وسمعنا النصيحة. ولكن من هذه النقطة، بدأت في تغيير مكاني والجلوس في أماكن أخرى كنوع من التغيير.
    `,
  },
  {
    id: "id5",
    icon: <FaSmile size={30} />,
    title: "مواقف ايجابية",
    text: `
أثناء تغييري لمكان جلوسي، توجهت في إحدى المرات إلى مصلى المدرسة. هناك، وجدت أحد التلاميذ الذين أعرفهم يحاول حفظ بعض الآيات. جلست معه وبدأت في التسميع له ومساعدته، وعقدنا اتفاقًا على الجلوس أسبوعيًا في المصلى للمراجعة.

في خلال أربع لقاءات، أتم الطالب حفظ المهمة الموكلة له، وشعر بسعادة كبيرة وبدأ في الثناء علي. كان هذا بمثابة خير نابع من حدث قد شعرت فيه بالإحباط والسوء. وكما يقال، "عسى أن تكرهوا شيئًا وهو خير لكم".
    `,
  },
  {
    id: "id5",
    icon: <FaCalendarDay size={30} />,
    title: "أول يوم في التطبيقات",
    text: `
شعرت بالحماس والتفاؤل لبداية هذه التجربة الجديدة. كانت لدي رغبة قوية في إثبات نفسي واكتساب أكبر قدر ممكن من الخبرة.
عندما دخلت المدرسة، شعرت بالطاقة الإيجابية تحيط بي، وقدمت نفسي بكل ثقة كمعلم متدرب. لم أشعر بالارتباك أو التوتر، بل كانت لدي رغبة حقيقية في التعلم والتطوير. شعرت أنني في المكان المناسب لتحقيق أهدافي المهنية والشخصية.
    `,
  },
  {
    id: "id5",
    icon: <FaCalendarCheck size={30} />,
    title: "أخر يوم في التطبيقات",
    text: `
شعرت بالرضا والامتنان على كل ما حققته خلال هذه الفترة. نظرت إلى الوراء على جميع التحديات التي واجهتها والأمور التي تعلمتها، وشعرت بالفخر للتقدم الذي أحرزته. كانت لدي مشاعر مختلطة من الفرح لاقتراب تحقيق هدفي، والحزن لانتهاء هذه التجربة التي كانت غنية بالتعلم والتطوير. شعرت أنني أصبحت شخصًا أكثر نضجًا وثقة، وأنني مستعد الآن لمواجهة التحديات القادمة في مسيرتي التعليمية بمزيد من التفاؤل والطموح    `,
  },
];

const About = () => {
  return (
    <div>
      <LayoutWithImage
        photoUrls={[myImg8, myImg5, myImg4, myImg6, myImg7, myImg9, myImg10, myImg]}
        text= "مرحباً بكم في بورتفوليو التطبيقات العملية الخاص بي! هنا، ستتعرفون على رحلتي التعليمية وتطوري المهني كطالب أكاديمي, حيث أسعى لإحداث تأثير إيجابي في عالم علم الحاسوب, ومن خلال تجاربي في مدرسة الثانوية الشاملة في أم الفحم. ستجدون هنا مزيجًا رائعًا من الابتكار والتميز، مصحوبًا بمحتويات مثيرة وتفاعلية تعكس شغفي بالتعليم وتطوري المستمر. شكراً لزيارتكم، وأتمنى أن تجدوا في هذا الموقع متعة وفائدة تلهمكم لاستكشاف المزيد!"
        signature={<Signature />}
      />
      <ScrollArrow targetId="whoami-section" />
      {sections.map((section, index) => (
        <Section
          id={section.id}
          key={index}
          icon={section.icon}
          title={section.title}
          date={section.date}
          text={section.text}
          links={section.links}
          images={section.images}
        />
      ))}
    </div>
  );
};

export default About;
