import React from "react";
import Section from "./Section";
import {
  FaBook,
  FaInfoCircle,
  FaRegBuilding,
  FaUser,
  FaUsers,
} from "react-icons/fa";
import imgPlaceholder from "../../imgs/img-ph-150.png";
import imgmOdt1 from "../../imgs/ODT/img1.jpg";
import imgmOdt2 from "../../imgs/ODT/img5.jpg";
import imgmOdt3 from "../../imgs/ODT/img6.jpg";
import imgmOdt4 from "../../imgs/ODT/img9.jpg";
import imgmsportDay1 from "../../imgs/sports_day/img1.jpg";
import imgmsportDay2 from "../../imgs/sports_day/img2.jpg";
import imgmsportDay3 from "../../imgs/sports_day/img4.jpg";
import imgmsportDay4 from "../../imgs/sports_day/img5.jpg";
import imgmsci1 from "../../imgs/science_center/img1.jpg";
import imgmsci2 from "../../imgs/science_center/img2.jpg";
import imgmisraa1 from "../../imgs/israa_meraaj/img1.jpg";
import imgmisraa2 from "../../imgs/israa_meraaj/img2.jpg";
import imgmisraa3 from "../../imgs/israa_meraaj/img3.jpg";
import imgmisraa4 from "../../imgs/israa_meraaj/img4.jpg";
import imgm1 from "../../imgs/algorithm1_2/img17.jpg";
import imgm2 from "../../imgs/algorithm1_2/img20.jpg";
import imgm3 from "../../imgs/hour_of_code_4_5/img3.jpg";
import imgm4 from "../../imgs/hour_of_code_4_5/img7.jpg";

const sections = [
  {
    id: "id1",
    icon: <FaUser size={30} />,
    title: "فعالية ODT (في المدرسة)",
    date: "07/12/2023",
    text: `
في يوم الخميس، 7 ديسمبر 2023، شاركنا في فعالية ODT (Outdoor Training) في المدرسة، حيث كانت فرصة رائعة للطلاب للاستمتاع بالأنشطة اللا منهجية والتفاعل مع بعضهم البعض في بيئة ترفيهية وتنافسية.

بدأ اليوم بتجمع الطلاب في الساحة الرئيسية، حيث تم تقديم شرح سريع عن الأنشطة التي ستقام. كانت الأجواء مليئة بالحماس والتشوق، وبدأت الأنشطة مع فعالية تسلق الحبال. تم تجهيز الحبال بين الأشجار، حيث تسابق الطلاب لتسلق الحبال والوصول إلى القمة في أسرع وقت ممكن. كان التحدي يتطلب القوة البدنية والتوازن، وشهدنا الكثير من الحماس والتشجيع من زملائهم.

بعد ذلك، انتقلنا إلى فعالية التصويب باستخدام سلاح يطلق خرز ملون، والمعروفة باسم "Paintball." تم تقسيم الطلاب إلى فرق، وتجهيزهم بالملابس الواقية والأسلحة. بدأت المباراة، حيث تنافس الطلاب على إصابة الأهداف وجمع النقاط. كانت هذه الفعالية مليئة بالإثارة والمنافسة، وأظهرت قدرة الطلاب على التركيز والدقة في التصويب.

ثم جاءت فعالية القفز والانزلاق باستخدام حبل مثبت في بكرة بين جهتين، والمعروفة باسم "Zip Line." كان هذا النشاط مثيرًا للغاية، حيث قفز الطلاب من منصة عالية وانزلقوا بسرعة عبر الحبل للوصول إلى الجهة الأخرى. كانت التجربة مليئة بالأدرينالين والمرح، وشهدنا الكثير من الابتسامات والضحك.

تم تنظيم الأنشطة على مراحل لضمان مشاركة جميع شعب المدرسة، حيث أتيحت الفرصة لكل مجموعة للاستمتاع بجميع الفعاليات. كان التنسيق ممتازًا، واستمتع الطلاب بوقتهم في كل محطة دون أي تعارض في الجدول الزمني.

خلال اليوم، لاحظت أن أحد الطلاب كان مترددًا في المشاركة في تسلق الحبال، ولكن بعد تشجيع زملائه وتوجيهات المدربين، قرر المحاولة وتمكن من النجاح والوصول إلى القمة. كانت لحظة فخر وسعادة للجميع

كان يوم حافل وممتع.
      `,
    images: [
      { src: imgmOdt1, alt: "Sample Image 1" },
      { src: imgmOdt2, alt: "Sample Image 2" },
      { src: imgmOdt3, alt: "Sample Image 3" },
      { src: imgmOdt4, alt: "Sample Image 4" },
    ],
  },
  {
    id: "id2",
    icon: <FaBook size={30} />,
    title: "فعالية اليوم الرياضي (في المتناس) ",
    date: "12-14/12/2023",
    text: `
من 12 إلى 14 ديسمبر 2023، شاركنا في فعالية رياضية ممتدة على مدار ثلاثة أيام في المتناس، حيث استمتعنا بالعديد من الأنشطة الرياضية والتفاعلية مع الطلاب. هذه الفعالية لم تكن مجرد حدث رياضي بل كانت تجربة تفاعلية تعزز الروح الرياضية وتكسر الحواجز التقليدية بين الطلاب والمعلمين.

بدأت القي نظرة على المحطات والطلاب وكان هنالك تلك الفعالية التي لا اقاومها فعالية تحدي كرة القدم 4 مقابل 4 بين المعلمين والطلاب. 
بما أن العديد من المعلمين، وأنا من ضمنهم، نعشق كرة القدم، كان التحدي ممتعًا للغاية. في البداية، فاز المعلمون بسهولة على الطلاب، مما دفعنا إلى تقسيم الفرق بشكل متوازن لضمان أن تكون المنافسة عادلة ومثيرة للجميع. هذا أضاف جوًا من المرح والتحدي الودي، وجعل الطلاب يشعرون بأنهم يلعبون مع أصدقائهم بدلاً من معلميهم.

بعد ذلك، شاركنا في فعالية التصويب بالقدم، حيث كان على الطلاب والمعلمين التصويب على هدف يحتوي على دوائر ملونة مختلفة. كلما كانت الكرة أقرب إلى المركز الأحمر، كلما زادت النقاط. كانت هذه الفعالية ممتعة ومليئة بالتشجيع، حيث حاول الجميع تحقيق أفضل تصويب ممكن.

ثم جاءت فعالية التمسك والتشبث باليدين والتنقل بين المسلول، وهي فعالية تتطلب قوة بدنية كبيرة في اليدين وعضلات الظهر. أظهر الطلاب شجاعة وتصميمًا كبيرًا في اجتياز هذا التحدي، مما أظهر لنا مدى قدرتهم على التحمل والصمود.

كما تضمنت الفعالية تحدي تسلق القلعة المنفوخة بالهواء. هذه القلعة الكبيرة كانت شديدة الانحدار، وكان على الطلاب الاندفاع بقوة والتشبث بالعصي للوصول إلى القمة. كان مشهد الطلاب والمعلمين وهم يحاولون التسلق مليئًا بالضحك والتشجيع، وأضفى جوًا من الإثارة على اليوم.

تضمن اليوم أيضًا لعبة البولينج باستخدام القدم، حيث حاول المشاركون ضرب الكرة بقدمهم لإصابة الأهداف. كان هذا التحدي جديدًا ومثيرًا، وجلب الكثير من الضحك والمرح. اختتمنا اليوم بلعبة السلة، حيث تنافس الجميع لإحراز أكبر عدد من النقاط في السلة. كان الجو مليئًا بالحماس والتشجيع، وأظهر الطلاب مهارات رائعة في التصويب.

خلال الفعالية، شارك المعلمون بشكل جدي في التحديات، مما خلق جوًا فكاهيًا ومحببًا بين الطلاب والمعلمين. كانت العلاقة بينهم أكثر من مجرد علاقة معلم وطالب، بل أصبحت علاقة أصدقاء وزملاء وخصوم اقوياء في اوقات التحديات.

تم تقسيم الفعالية على مدار ثلاثة أيام لإتاحة الفرصة لجميع الطلاب من مختلف الطبقات في المدرسة للاستمتاع بالأنشطة. كانت الفعالية الأولى مخصصة لطلاب طبقة صفوف العواشر يوم الثلاثاء، والثانية لطلاب طبقة صفوف الحادي عشر يوم الأربعاء، والأخيرة لطلاب طبقة صفوف الثاني عشر يوم الخميس. كانت تجربة لا تُنسى مليئة بالتحدي، الضحك، والتعاون بين الجميع
      `,
      images: [
        { src: imgmsportDay1, alt: "Sample Image 1" },
        { src: imgmsportDay2, alt: "Sample Image 2" },
        { src: imgmsportDay3, alt: "Sample Image 3" },
        { src: imgmsportDay4, alt: "Sample Image 4" },
      ],
  },
  {
    id: "id3",
    icon: <FaRegBuilding size={30} />,
    title: "فعالية يوم العلوم (في المدرسة)",
    date: "19/12/2023",
    text: `
يوم الخميس، 19 ديسمبر 2023، كان يوماً مميزاً في المدرسة حيث تم إقامة فعاليات "يوم العلوم" التي تضمنت العديد من المحطات العلمية المتنوعة والممتعة. هذا اليوم كان دليلاً على تفوق طلاب المدرسة وإلمامهم بالعديد من المواضيع العلمية. المحطات شملت الكيمياء، البيولوجيا، البرمجة (روبوتيكا)، الإلكترونيات، والفيزياء.

بدأ اليوم بتجمع الطلاب في الساحة الرئيسية، حيث تم تقديم الفعالية والترحيب بالحضور. كانت المحطة الأولى هي محطة الكيمياء، حيث قام الطلاب بعروض تفاعلية تضمنت تفاعلات كيميائية مثيرة. أظهر الطلاب كيفية صنع البركان الكيميائي وتفاعل الفيل الفوار، مما أثار إعجاب الحضور.

بعد ذلك، انتقلنا إلى محطة البيولوجيا التي ركزت على جسم الإنسان، حيث تم تقديم عروض تفاعلية عن وظائف الأعضاء وأهمية العناية بالصحة. الطلاب شرحوا كيفية عمل الجهاز الهضمي، وتمكنوا من استخدام نماذج ثلاثية الأبعاد لتوضيح تلك العمليات.

المحطة التالية كانت البرمجة (روبوتيكا)، حيث تم عرض روبوتات تم برمجتها من قبل الطلاب. قاموا بشرح كيفية برمجة الروبوتات للقيام بمهام معينة، وصنعوا أفكاراً جديدة مثل الروبوتات التي تقوم بسكب المعقم على يدك بدون لمس أي شيء، فقط ضع يدك تحت فوهة المعقم لتقوم الآلة بسكب القليل لك بدون لمسها. هذه المحطة جذبت الكثير من الانتباه وأظهرت مهارات الطلاب في البرمجة والتكنولوجيا.

محطة الإلكترونيات كانت مثيرة أيضًا، حيث قدم الطلاب مشاريع إلكترونية مثل الدوائر الكهربائية وأجهزة الاستشعار. شرحوا كيفية عمل هذه الأجهزة وكيفية استخدامها في الحياة اليومية. كانت هناك تجربة تفاعلية لبناء دائرة كهربائية بسيطة، مما أتاح للطلاب فرصة لتطبيق ما تعلموه.

أخيراً، جاءت محطة الفيزياء، حيث تم تقديم تجارب فيزيائية تفاعلية. أظهر الطلاب تجارب عن قوانين الحركة والطاقة، مثل تجربة البندول وتجربة الضغط الجوي. كانت هذه المحطة مليئة بالنشاط والحيوية وأظهرت فهماً عميقاً للعلوم الفيزيائية.

في ختام الفعالية، تم توزيع الجوائز على الطلاب الذين قدموا أفضل العروض، وتقدمت إدارة المدرسة بالشكر لكل من ساهم في إنجاح هذا اليوم الرائع. كان يوم العلوم تجربة تعليمية ممتعة ومليئة بالفخر لطلاب المدرسة، وأظهر قدراتهم العالية ومعرفتهم الواسعة في مختلف المجالات العلمية.
      `,
    images: [
      { src: imgmsci1, alt: "Sample Image 1" },
      { src: imgmsci2, alt: "Sample Image 2" },

    ],
  },
  {
    id: "id4",
    icon: <FaUsers size={30} />,
    title: "فعالية التنمية لتفكير (في المدرسة غرف الحاسوب) ",
    date: "25/01/2024",
    text: `
في يوم الخميس، 25 يناير 2024، قدمت أنا وزملائي من طلاب أكاديمية القاسمي فعالية "Hour of Code" لطلاب الصف العاشر في إطار مساق "التجربة العملية" تحت إشراف المعلمة فاطمة كبها. هدفنا كان تعزيز فهم الطلاب لمفهوم الـ Algorithm وتطبيقه من خلال أنشطة تفاعلية وألعاب تعليمية.

بدأت الفعالية بعرض فيديو تعليمي يوضح مفهوم الـ Algorithm بطريقة ممتعة ومضحكة. الفيديو أظهر سلسلة من المشاهد التي تشرح كيفية تنفيذ الحاسوب للخطوات بشكل دقيق وتفصيلي، مما جذب انتباه الطلاب وأثار فضولهم.

بعد ذلك، انتقلنا إلى شرح لعبة Tower of Hanoi، حيث شرحنا أهميتها في تطبيق التفكير اللوجستي والتخطيط الاستراتيجي. قمنا بعرض أمثلة عملية ووجهنا الطلاب لتجربة اللعبة بأنفسهم، محاولين حل تحدي الحركة الأقل لنقل الأقراص من عمود لآخر. كانت الأجواء مليئة بالحماس والتحدي، ولاحظنا روح التنافس والتعاون بين الطلاب.

الحصة الأكبر من الفعالية كانت مخصصة لمنصة Hour of Code، حيث استعرضنا ألعابًا تعليمية مثل Flappy Bird، Mario، Frozen، Angry Birds، وMinecraft. قمنا بشرح كيفية استخدام كل لعبة لتعلم أساسيات البرمجة وشجعنا الطلاب على استكشاف الألعاب بأنفسهم. كانت هذه المرحلة مليئة بالتفاعل والمرح، حيث حاول الطلاب تطبيق المفاهيم البرمجية من خلال اللعب.

وفي الختام تم ارفاق استبيان لتقيم ما تعلموه واستفادوه من الفعالية

كانت فعالية "Hour of Code" تهدف إلى تعزيز فهم الطلاب لمفاهيم البرمجة وتطبيق التفكير اللوجستي من خلال ألعاب تفاعلية. تفاعل الطلاب بشكل فعّال مع الأنشطة وأظهروا إبداعًا وابتكارًا في تصميم الألعاب وتطبيق المفاهيم التي تعلموها. استجابة الطلاب كانت نشطة ومليئة بالحماس، مما جعلنا نشعر بالرضا عن جهودنا والنجاح الذي حققناه في إثارة فضولهم نحو عالم البرمجة وتطبيقات الـ Algorithm.
      `,
    images: [
      { src: imgm1, alt: "Sample Image 1" },
      { src: imgm2, alt: "Sample Image 2" },
      { src: imgm3, alt: "Sample Image 3" },
      { src: imgm4, alt: "Sample Image 4" },
    ],
  },
  {
    id: "id5",
    icon: <FaInfoCircle size={30} />,
    title: "فعالية الاسراء والمعراج",
    date: "06/02/2024",
    text: `
في يوم الثلاثاء، 6 فبراير 2024، احتفلنا بفعالية الإسراء والمعراج في المدرسة، حيث قمنا، بتنظيم وتنسيق بعض الفعاليات واضفاء بعض البصمات لهذا اليوم. بدأنا التحضيرات من قبل اسبوع قبل هذا اليوم، حيث بحثنا عن عبارات وجمل تتعلق بالإسراء والمعراج لطبعها ونشرها في ممرات المدرسة، وفعاليات ممكن تقديمها لهذا اليوم, مما أضفى جوًا من الروحانية والإيمان.

بدأت الفعالية بشرح مفهوم الإسراء والمعراج، حيث سردنا القصص والأحداث الجميلة التي حدثت مع نبينا محمد صلى الله عليه وسلم. استخدمنا أسلوبًا قصصيًا مشوقًا لجذب انتباه الطلاب وإثرائهم بالمعلومات حول هذا الحدث العظيم. تفاعل الطلاب بشكل كبير مع القصص، وأبدوا اهتمامًا واستفسارات حول التفاصيل.

بعد أن أغنيناهم بالمعلومات، انتقلنا إلى الفعالية الترفيهية. قمنا بتقسيم الصف إلى فريقين وأعددنا لعبة X O كتحدي أسئلة. كانت الأسئلة تتعلق بمعلومات عن الإسراء والمعراج، وكان لكل فريق وقت محدد للإجابة. إذا لم يستطع الفريق الإجابة خلال الوقت المحدد، ينتقل السؤال إلى الفريق الآخر. الفريق الذي يجيب بشكل صحيح يختار مكان وضع الإشارة التي تمثل فريقه على لوحة اللعبة.

الفعالية كانت مليئة بالحماس والتنافس الشريف. لاحظنا تفاعل الطلاب وتحفزهم للإجابة على الأسئلة بسرعة وبدقة. كانت هناك لحظات من الفرح والاحتفال عندما ينجح فريق في الحصول على ثلاث إشارات متتالية، وأخرى من الترقب والتوتر عندما تكون النتيجة متقاربة.

اختتمنا الفعالية بشكر الطلاب على مشاركتهم وتفاعلهم، وأكدنا على أهمية هذا اليوم وضرورة الاحتفال به كل عام لتذكيرنا بمعجزات نبينا محمد صلى الله عليه وسلم. كانت الفعالية ناجحة جدًا وأضفت جوًا من المعرفة والإيمان بين الطلاب.
      `,
    images: [
      { src: imgmisraa1, alt: "Sample Image 1" },
      { src: imgmisraa2, alt: "Sample Image 2" },
      { src: imgmisraa3, alt: "Sample Image 3" },
      { src: imgmisraa4, alt: "Sample Image 4" },
    ],
  },
  {
    id: "id6",
    icon: <FaInfoCircle size={30} />,
    title: "مسيرة الكشاف",
    date: "02/04/2024",
    text: `
في يوم الثلاثاء، 2 أبريل 2024، شاركنا في فعالية مسيرة الكشاف في مدينة أم الفحم. كانت المسيرة تهدف إلى تعزيز روح التعاون والانتماء بين الطلاب والمجتمع. تجمعنا في ساحة المدينة الرئيسية، حيث ارتدى جميع المشاركين زي الكشاف الرسمي.

بدأت المسيرة بتحية واعلام وطبول، مما أضفى جوًا من الفخر والانتماء. انطلقنا بعد ذلك في مسيرة جابت شوارع المدينة، وملأنا الجو بالحماس والفرح. كانت العائلات والسكان المحليون يقفون على جانبي الطريق، يلوحون لنا ويشجعوننا.

خلال المسيرة، التزم الجميع بالنظام والترتيب، وتبادلنا الأحاديث والقصص عن تجاربنا الكشفية. كانت الأجواء مليئة بالفرح والتعاون، وأظهر الطلاب روح الفريق والعمل الجماعي. في نهاية المسيرة، تجمعنا في الحديقة العامة، حيث تم توزيع المرطبات والهدايا التذكارية على المشاركين.

اختتمت الفعالية بكلمات شكر وتقدير من قادة الكشافة والمعلمين، الذين أثنوا على جهود الجميع في إنجاح هذا اليوم. كانت مسيرة الكشاف في أم الفحم يومًا مليئًا بالأنشطة الممتعة والتجارب القيمة التي عززت روح الانتماء والمشاركة بين الطلاب والمجتمع
      `,
   
  },
];

const Activities = () => {
  return (
    <div style={{ paddingTop: 65 }}>
      {sections.map((section, index) => (
        <Section
          id={section.id}
          key={index}
          icon={section.icon}
          title={section.title}
          date={section.date}
          text={section.text}
          images={section.images}
        />
      ))}
    </div>
  );
};

export default Activities;
