import React from "react";
import Section from "./Section";
import {
  FaBook,
  FaInfoCircle,
  FaRegBuilding,
  FaUser,
  FaUsers,
} from "react-icons/fa";
import { FaBullhorn } from "react-icons/fa";
import { FaChalkboard } from "react-icons/fa";
import { FaCheckCircle } from "react-icons/fa";
import { FaChalkboardTeacher } from "react-icons/fa";
import { FaEye } from "react-icons/fa";

const sections = [
  {
    id: "id1",
    icon: <FaEye size={30} />,
    title: "دروس المشاهدات",
    text: `
كان حضور دروس المشاهدات تجربة تعليمية غنية، حيث أتيح لي فرصة مراقبة أساليب تدريس متنوعة واستراتيجيات تعليمية متعددة. استفدت من هذه الدروس في فهم كيفية توصيل المعلومات بطرق مختلفة وتوظيف الوسائل التعليمية بشكل فعّال.

نقاط القوة:

تنظيم الدروس: جميع الدروس كانت منظمة بشكل جيد، مما ساعد الطلاب على استيعاب المعلومات بسهولة.
التفاعل الإيجابي: أظهر المعلمون قدرة على خلق بيئة تعليمية مشجعة، حيث كانوا يتفاعلون مع الطلاب بشكل إيجابي ومحفز.
استخدام الوسائل التعليمية: استُخدمت وسائل تعليمية متنوعة، مما ساعد في توضيح المفاهيم وتعزيز
مجالات للتحسين:

ضبط سرعة الشرح: كان يمكن لبعض المعلمين ضبط سرعة الشرح لضمان استيعاب جميع الطلاب.
تنويع الأنشطة: إضافة أنشطة تعليمية أكثر تفاعلية يمكن أن تكسر الروتين وتزيد من مشاركة الطلاب.
الخاتمة:
كانت مشاهدة الدروس تجربة تعليمية ملهمة، تعلمت من خلالها أهمية تنظيم الدروس واستخدام الوسائل التعليمية بشكل فعّال. سأستفيد من هذه التجربة في تحسين أدائي التدريسي في المستقبل.       `,
  },
  {
    id: "id2",
    icon: <FaChalkboardTeacher size={30} />,
    title: "دروس قدمتها",
    text: `
تقديم الدروس كان فرصة لتطبيق ما تعلمته عملياً، حيث تمكنت من تقييم أدائي التدريسي والحصول على تغذية مرتدة من الطلاب والمعلمين.

نقاط القوة:

وضوح الأهداف التعليمية: تحديد الأهداف بوضوح ساعد في توجيه الطلاب وفهم ما يتوقع منهم.
استخدام الوسائل التعليمية: استخدام وسائل تعليمية متنوعة جعل الدروس أكثر جاذبية وتفاعلاً.
التفاعل الإيجابي مع الطلاب: شجعت الطلاب على المشاركة والتفاعل، مما زاد من حماسهم واستيعابهم للمادة.
مجالات للتحسين:

تنويع الأنشطة التعليمية: يمكن تحسين التجربة التعليمية من خلال دمج مزيد من الأنشطة العملية والمرئية لتعزيز الفهم.
تعزيز الدعم الفردي: تقديم شروحات إضافية وأمثلة توضيحية للطلاب الذين يحتاجون إلى دعم إضافي بشكل أكثر تنظيمًا.
الخاتمة:
كانت تجربة تقديم الدروس مفيدة وملهمة، ساعدتني في تحسين مهاراتي التدريسية وتطبيق ما تعلمته بشكل عملي. سأستمر في تطوير أدائي واستخدام التغذية المرتدة لتحسين جودة الدروس المستقبلية.      `,
  },
  {
    id: "id3",
    icon: <FaCheckCircle size={30} />,
    title: "درس التقييم - שפת סף",
    text: `
تقديم درس التقييم في موضوع "لغة التجميع" كان تحديًا مميزًا، حيث تطلب مني استخدام استراتيجيات تعليمية متقدمة وتوظيف الأنشطة التفاعلية لتعزيز الفهم.

نقاط القوة:

استخدام الأمثلة الواقعية: ساعدت الأمثلة الواقعية في توضيح المفاهيم وتعزيز الفهم.
التفاعل مع الطلاب: شجعت الطلاب على المشاركة وطرح الأسئلة، مما عزز من تفاعلهم مع المادة.
تنظيم الأنشطة التعليمية: كانت الأنشطة منظمة بشكل جيد ومترابطة، مما سهل على الطلاب متابعة الدرس.
مجالات للتحسين:

زيادة التنوع في الأنشطة: إضافة مزيد من الأنشطة التفاعلية لتعزيز تجربة التعلم.
تقديم تغذية راجعة فورية: استخدام وسائل تكنولوجية مثل الاستبيانات الإلكترونية للحصول على تغذية راجعة فورية من الطلاب حول الدرس.
الخاتمة:
كانت تجربة تقديم درس التقييم مفيدة وغنية بالتعلم، حيث ساعدتني على تحسين مهاراتي في توصيل المفاهيم الصعبة بطرق سهلة ومفهومة. سأستفيد من التغذية المرتدة في تحسين أدائي في الدروس المستقبلية.      `,
  },
  {
    id: "id4",
    icon: <FaChalkboard size={30} />,
    title: "مركز التعلم",
    date: "",
    text: `
كان يوم مركز التعلم تجربة تعليمية مميزة، حيث أتيح لي فرصة تنظيم أنشطة تفاعلية وإشراك الطلاب في تجربة عملية حية.

نقاط القوة:

استخدام الأنشطة العملية: ساعدت الأنشطة العملية في توضيح المفاهيم وجعلها أكثر واقعية.
التفاعل مع الطلاب: خلق جو تفاعلي ومحفز، مما ساعد على تعزيز الفهم وزيادة حماس الطلاب.
التنظيم الجيد: كان التنظيم الجيد للأنشطة والمحطات التفاعلية عاملًا مهمًا في نجاح اليوم التعليمي.
مجالات للتحسين:

زيادة التنوع في الأنشطة: يمكن تحسين التجربة من خلال إضافة أنشطة متنوعة تشمل جوانب أخرى من المفاهيم التعليمية.
تعزيز الدعم الفردي: تقديم شروحات إضافية وأمثلة توضيحية للطلاب الذين يحتاجون إلى دعم إضافي بشكل أكثر تنظيمًا.
الخاتمة:
كانت تجربة يوم مركز التعلم ملهمة وغنية بالتعلم، حيث ساعدت في تحسين مهاراتي التنظيمية والتفاعلية. سأستفيد من التغذية المرتدة لتحسين تنظيم الفعاليات المستقبلية وتقديم تجارب تعليمية أكثر تنوعًا وإثارة للطلاب.      `,
  },
  {
    id: "id5",
    icon: <FaBullhorn size={30} />,
    title: "الفعاليات اللا منهجية",
    date: "",
    text: `
المشاركة في تنظيم الفعاليات كانت تجربة غنية ومليئة بالتحديات، حيث أتيح لي فرصة تنسيق أنشطة متنوعة وتعزيز روح التعاون بين الطلاب.

نقاط القوة:

تنظيم جيد للفعاليات: ساعد التنظيم الجيد في إنجاح الفعاليات وإشراك الطلاب بشكل فعّال.
التفاعل الإيجابي: ساعدت الأنشطة التفاعلية في تعزيز روح الفريق والتعاون بين الطلاب.
التنوع في الأنشطة: تنوع الأنشطة ساعد في كسر الروتين وزيادة حماس الطلاب.
مجالات للتحسين:

زيادة التنوع في الأنشطة: يمكن إضافة مزيد من الأنشطة التفاعلية لتعزيز تجربة المشاركين.
تعزيز الدعم الفردي: تقديم دعم إضافي للطلاب الذين يحتاجون إلى توجيهات أو مساعدة خاصة خلال الفعالية.
الخاتمة:
كانت الفعاليات تجربة تعليمية واجتماعية غنية وممتعة، ساعدت في تعزيز روح التعاون والانتماء بين الطلاب والمجتمع. سأستفيد من التغذية المرتدة لتحسين تنظيم الفعاليات المستقبلية وتقديم تجارب تعليمية واجتماعية أكثر تنوعًا وإثارة للطلاب.      `,
  },
];

const Feedback = () => {
  return (
    <div style={{ paddingTop: 65 }}>
      {sections.map((section, index) => (
        <Section
          id={section.id}
          key={index}
          icon={section.icon}
          title={section.title}
          date={section.date}
          text={section.text}
          images={section.images}
        />
      ))}
    </div>
  );
};

export default Feedback;
