import React from "react";
import Section from "./Section";
import { FaUniversity } from "react-icons/fa";
import imgPlaceholder from "../../imgs/img-ph-150.png";
import { FaLock } from "react-icons/fa";

const sections = [
  {
    id: "id1",
    icon: <FaLock size={30} />,
    title: "الحماية الرقمية",
    date: "27/05/2024",
    text: `
في يوم مركز التعلم الذي عُقد في 27 مايو 2024، قدمنا يومًا حافلًا بالفعاليات والدروس العملية في موضوع الحاسوب، وكان يهدف إلى تقديم تجربة تعليمية تفاعلية للطلاب، بكشل تطبيقي عملي لا منهجي. بدأ التحضير لهذا اليوم قبل أسبوع، حيث كنا نعمل معًا كفريق من طلاب أكاديمية القاسمي على تطوير أفكار متنوعة لفعاليات تعليمية. كانت جلساتنا التحضيرية مليئة بالنقاشات والتجارب العملية، حيث كنا نقدم أفكارنا لبعضنا البعض ونقوم بتقييمها، مما ساعدنا على تحسين كل فكرة لتكون جاهزة ليوم الحدث.

في يوم مركز التعلم، كان لكل طالب أكاديمي محطة خاصة به لشرح جانب من جوانب علم الحاسوب بشكل عملي ويدوي لطلاب المدرسة ليتذوق الطالب طعم التجربة العملية ويعيش شعور التجربة. هدفت هذه الفعاليات إلى غمر الطلاب في تجربة عملية حية، ليعيشوا شعور الاكتشاف والتعلم بأنفسهم.

محطات الفعاليات:

سباق الكلمات: حيث تنافس الطلاب في كتابة النصوص بسرعة باستخدام اللغة التي يفضلونها، مما ساعدهم على تحسين مهارات الكتابة وسرعة الطباعة.
طابعة الـ 3D: قدمت محطة تعرف الطلاب على كيفية عمل طابعات ثلاثية الأبعاد, واعطاء معلومات عامه على كونها تقوم بطباعة مجسمات ضخمة ومباني وحتى تقوم بطباعة الطعام ايضا وكما قامو بتجربة طباعة مجسمات بسيطة، مما أثار دهشتهم وإعجابهم بالتكنولوجيا المتقدمة.
الألوان في الحاسوب: شرحت هذه المحطة كيف يتعرف الحاسوب على الألوان ويميزها، حيث انه بمفهومنا العام ومفهوم الانسان تعلم ماهية الاوان من الصغر ليميزها, لاكن السؤال هو كيف للحاسوب ان يميز هذه الالوان؟ مما عزز فهمهم للعمليات الرقمية الأساسية.
التشفير وفك الرموز: تعرف الطلاب على أساليب التشفير وفك الرموز، مما ساعدهم على فهم أهمية حماية البيانات.
أحد الأنشطة البارزة كان غرفة الهروب (Escape Room)، حيث تم تقسيم الطلاب إلى فرق وتم تزويدهم بألغاز ورموز لحلها باستخدام المعلومات التي تعلموها في المحطات الأخرى. كان الفريق الأسرع في حل الألغاز هو الفائز، مما أضاف جوًا من التحدي والإثارة.

والجدير بذكره ايضا هو دور المعلم أحمد اغبارية في تغذية افكارنا بأفكارًا جديدة، بمشاركة افكارة النيره معنا عن ما يمكن ان يشمله هذا اليوم "مركز التعلم"  واعطي فكرة جميلة مثل تجربة نظارات الـ 3D والتعرف على أجزاء الحاسوب من الداخل. وانار افكارنا بمواضيع اخرى شتى. كانت أفكاره كنسمة من الإبداع التي أضافت بعدًا جديدًا لليوم، حيث أثرت واوقدت افكار جديده لدينا.

ومن هنا سابدأ بشرح الفعالية التي اديتها:
محطتي: الأمن السيبراني والتشفير:
كانت محطتي تركز على توعية الطلاب بمفهوم الأمن السيبراني وأهمية التشفير في حماية المعلومات الرقمية. بدأت الفعالية بتحية الطلاب وتقديم مقدمة حول أهمية الأمن السيبراني عن طريق شرح مفاهيم التشفير، بما في ذلك تشفير قيصر، من خلال أمثلة واقعية وتمارين على اللوح.

التطبيق العملي:
طلبت من الطلاب النهوض وأخذ قناني بلاستيكية تحتوي على أوراق مشفرة. وقبل فتحها، أوضحت لهم مفهوم الرسائل المشفرة بالتطرق الى مثال يرونه كل يوم في تطبيق واتس اب وهو ان الرسائل بينك وبين الطرف الاخر مشفرة تمام ماذا يعنه ذلك؟ ولماذا هي مشفرة؟ ومن من؟. 
بدأ الطلاب باعطاء الفرضيات واجوبة حتى توصلنا الى اجابة ان الطرف التالث وهو ما يسمى بـ  الهاكر وهو الذي لا نريد منه فهم الرسئل اذا تم اختراقها لذلك نقوم بتشفيرها.
وبتالي طلبت منهم فتح القناني ورئية محتوى الرسالة وتفاجئوا بعدم فهم اي من الرموز المكتوبة.
عندها اشرت على ان موقفهم هذا هو مماثل لموقف الهاكر الذي لا يعلم قيمة المفتاح وقدر الازاحة. 
تفاعل الطلاب مع النشاط وبدأوا في فك تشفير الرسائل باستخدام قيمة المفتاح التي أعطيتها لهم، وتمثلت لهم كلامات تشجيعية مثل "great /you are fast/fantastic /wonderful ..." وبالتالي قمت ايضا بشرح ان هنالك العديد من انواع التشفير ومنها مثلا تشفير مورس عن طريق الاضائة او الصوت  مما جعلهم يشعرون بدهشة و بالإنجاز والفخر.

مفاجأة التحدي:
في النهاية، قدمت تحديًا للطلاب لكلمة مشقرة وعليهم بمحاولة فك تشفيرها باستخدام مفتاح مخفي بين سطور السؤال. كان هذا النشاط ممتعًا ومليئًا بالتحدي، حيث تفاعل الطلاب بشكل إيجابي وحماس.

اختتمت الفعالية بتوزيع هدايا رمزية للطلاب، تضمنت صورًا مشفرة تحتاج إلى فك تشفيرها باستخدام المرايا أو تحت الإضاءة، مما أضاف لمسة ممتعة وجعل الطلاب يشعرون بالإنجاز.

كان هذا اليوم مليئًا بالأنشطة التفاعلية التي قدمت للطلاب فرصة لتجربة واكتشاف مفاهيم علم الحاسوب بطريقة ممتعة وعملية. شعرت بالفخر لنجاح الفعالية ورؤية الطلاب يتفاعلون ويتعلمون بحماس.
      `,
    images: [
      { src: imgPlaceholder, alt: "Sample Image 1" },
      { src: imgPlaceholder, alt: "Sample Image 2" },
      { src: imgPlaceholder, alt: "Sample Image 3" },
      { src: imgPlaceholder, alt: "Sample Image 4" },
    ],
    links: [
      {
        href: "https://docs.google.com/document/d/1P5nCClAKUr-8V4Wdr7c8id5R35FRW5DPTOAoNFGOp4k/edit",
        title: 'مستند: "مخطط الدرس"',
      },
      {
        href: "https://docs.google.com/document/d/1y5eIFXezmS3b_3OP5WK_xflyuM6V1B0L3q2bGUxmuSc/edit",
        title: 'مستند: "مجرى الدرس"',
      },
      {
        href: "https://docs.google.com/document/d/1y5eIFXezmS3b_3OP5WK_xflyuM6V1B0L3q2bGUxmuSc/edit",
        title: 'مستند: "معروضة الدرس"',
      },
    ],
  },
];

const LearningCenter = () => {
  return (
    <div style={{ paddingTop: 65 }}>
      {sections.map((section, index) => (
        <Section
          id={section.id}
          key={index}
          icon={section.icon}
          title={section.title}
          date={section.date}
          text={section.text}
          images={section.images}
          links={section.links}
        />
      ))}
    </div>
  );
};

export default LearningCenter;
