import React from 'react';
import styled from '@emotion/styled';
import DocCard from './DocCard';
import imgPlaceholder from '../../imgs/img-ph-150.png';

const ObservationsContainer = styled.div`
  display: grid;
  grid-template-columns: repeat(auto-fill, minmax(300px, 1fr));
  gap: 20px;
  padding: 20px;
  padding-top: 95px;
`;

const exampleContent = `
  هذا هو نص محتوى المستند. يمكنك إضافة محتوى طويل هنا
  لرؤية كيفية ظهور المعاينة داخل البطاقة.
  يمكن أن يكون هذا النص مثالياً لوصف المستند.
`;

const docs = [
  {
    title: 'Class & Object',
    date: '2023-09-14 / الحصة الاولى',
    content: 'قدم المعلم أحمد اغبارية درسًا في علم الحاسوب للصف الحادي عشر، مركزًا على مفاهيم Class وObject. استُخدمت وسائل تعليمية تفاعلية مثل الأمثلة، التمارين، والحوار لتحفيز الطلاب على التفكير النقدي والمشاركة الفعالة. تم بدء الدرس بمقدمة موجزة توضح محتوى الدرس بهدف تحفيز اهتمام الطلاب.',
    link: 'https://docs.google.com/document/d/1dh_X73P8u0vu3Jg5LaqLMzeqtVegK6Wgqcy1C0vnSfg/edit',
  },
  {
    title: 'Class & Object',
    date: '2023-09-14 / الحصة الثانية',
    content: 'خلال الحصة الثانية، قدم المعلم المعلومات بشكل منظم ومنطقي، مع استخدام أمثلة وتوضيحات لزيادة الفهم. تم استخدام تمارين لتقييم فهم الطلاب، كما تم توفير مصادر تعليمية مثل الكتب والمواد المرجعية لمساعدة الطلاب في التعمق في الموضوع.',
    link: 'https://docs.google.com/document/d/1dh_X73P8u0vu3Jg5LaqLMzeqtVegK6Wgqcy1C0vnSfg/edit',
  },
  {
    title: 'Class & Object',
    date: '2023-09-14 / الحصة الثالثة',
    content: 'خلال الحصة الثالثة، بدأ المعلم بمقدمة تحفيزية واستخدم التمارين وأوراق العمل لتعزيز الفهم. تم تنويع الأنشطة التعليمية وطرائق التدريس للحفاظ على اهتمام الطلاب، مع التأكيد على النظام البيئي في الصف وضبط التوقيت والأخلاقيات. تم تحفيز الطلاب على التفكير النقدي واستكشاف المزيد، وتشجيعهم على المشاركة الفعالة والتعلم الذاتي.',
    link: 'https://docs.google.com/document/d/1dh_X73P8u0vu3Jg5LaqLMzeqtVegK6Wgqcy1C0vnSfg/edit',
  },
  {
    title: 'عمليات خارجية',
    date: '2023-09-19 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا في علم الحاسوب للصف الحادي عشر، مركزًا على موضوع العمليات الخارجية. استُخدمت وسائل تعليمية تفاعلية مثل الأمثلة، التمارين، والحوار لتحفيز الطلاب على التفكير النقدي والمشاركة الفعالة. تم تقديم الدرس بأسلوب قصصي لجذب انتباه الطلاب وتحفيزهم على المشاركة.',
    link: 'https://docs.google.com/document/d/167NWCN4x5Oj8MFrvEIqRu8-vkBhk1_i2vZ0v65uzdmk/edit',
  },
  {
    title: 'مصفوفة كائنات',
    date: '2023-09-19 / الحصة الثانية',
    content: 'في الحصة الثانية، استمر المعلم أحمد اغبارية في تناول موضوع مصفوفة كائنات. تم تنويع الأنشطة بين الأسئلة، سرد القصص والنقاشات بين الطلاب، مع الحفاظ على نظام مقبول في الصف. شجع المعلم الطلاب على التفكير النقدي وحب الاستطلاع، وتم تقييمهم بفعالية لقياس تحقيق الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/167NWCN4x5Oj8MFrvEIqRu8-vkBhk1_i2vZ0v65uzdmk/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-09-21 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا في علم الحاسوب للصف الحادي عشر، مركزًا على موضوع "מודלים חישוביים". بدأ الدرس بمقدمة تضمنت أمثلة واقعية لربط الموضوع بحياة الطلاب اليومية، مما ساعد في جذب انتباههم وإثارة فضولهم. تم تنظيم الصف بشكل جيد لخلق جو تعليمي مشجع ومريح.',
    link: 'https://docs.google.com/document/d/1VbU7ISRQpmkR2aFkqonLa_PsdNo_eSYnBpm6k3EiuKg/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-09-21 / الحصة الثانية',
    content: 'في الحصة الثانية، استمر المعلم أحمد اغبارية في تناول موضوع "מודלים חישוביים". تم استخدام وسائل تعليمية مثل الحاسوب وشاشة العرض، وتنويع طرق التدريس مع التركيز على الشرح واستخدام أمثلة واقعية لجذب انتباه الطلاب.',
    link: 'https://docs.google.com/document/d/1VbU7ISRQpmkR2aFkqonLa_PsdNo_eSYnBpm6k3EiuKg/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-09-21 / الحصة الثالثة',
    content: 'في الحصة الثالثة، تم استعراض المواد بشكل شامل وتقديم وسائل تقييم فعالة من خلال أسئلة صفية وواجبات منزلية. أظهر المعلم تمكنًا من المادة واستخدم لغة واضحة وصوتًا متنوعًا، مما ساهم في تركيز الطلاب. تفاعل المعلم مع الطلاب بشكل إنساني ومهني، مما خلق جوًا عائليًا في الصف.',
    link: 'https://docs.google.com/document/d/1VbU7ISRQpmkR2aFkqonLa_PsdNo_eSYnBpm6k3EiuKg/edit',
  },
  {
    title: 'أساسيات لغة البرمجة #C',
    date: '2023-09-21 / الحصة الخامسة',
    content: 'قدم المعلم مهند محاميد درسًا في علم الحاسوب لطلاب الصف العاشر حول أساسيات لغة البرمجة #C. بدأ الدرس بجدية مع نبذة تحضيرية، واستخدم وسائل تعليمية متنوعة مثل الألغاز والمسائل لتحفيز التفكير النقدي. أظهر المعلم تمكنًا من المادة وقدم أسئلة بطرق مختلفة، مما ساعد على استيعاب المعلومات. في نهاية الدرس، قدم ملخصًا للنقاط الرئيسية وحفز الطلاب على المشاركة الفعالة والتعلم المستمر.',
    link: 'https://docs.google.com/document/d/1XBnKw-WrAYw8zcpCjkdAMfMZhUtewZyqdoYIMCWnsKo/edit',
  },
  {
    title: 'HTML & CSS',
    date: '2023-09-26 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا في علم الحاسوب لطلاب الصف الثاني عشر حول إنشاء مشروع باستخدام HTML وCSS. بدأت الحصة بنشاط ملخص للدرس السابق مما ساهم في استرجاع المعلومات وتعزيزها. استُخدمت وسائل تعليمية متنوعة لتفاعل فعّال بين الطلاب والمعلم، مع وضوح في الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/12kT-gd8KKLUKCOJRqlhTEMZ5_3-jX1KKfBfhbkEgGn0/edit',
  },
  {
    title: 'HTML & CSS',
    date: '2023-09-26 / الحصة الثانية',
    content: 'في الحصة الثانية، تم تطبيق عملي للطلاب على مشروع لتلخيص مفهوم الدرس. تم تقييم مدى تحقيق الأهداف التعليمية بفعالية، مع استخدام كتب وأوراق عمل كمرجع إضافي. أظهر المعلم تمكنًا من المادة واستخدم لغة واضحة ومتنوعة، مما ساهم في تركيز الطلاب وفهمهم للمادة. كان الجو تعليميًا مشجعًا ومحفزًا على التفكير النقدي والمشاركة الفعالة.',
    link: 'https://docs.google.com/document/d/12kT-gd8KKLUKCOJRqlhTEMZ5_3-jX1KKfBfhbkEgGn0/edit',
  },
  {
    title: 'دوال Get & Set',
    date: '2023-10-03 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا في علم الحاسوب لطلاب الصف الحادي عشر، ركز على تحسين نقاط الضعف وتثبيت نقاط القوة في لغة #C، مع التركيز على وظائف Get وSet. بدأ الدرس بتحديد الأهداف التعليمية بوضوح، واستخدم وسائل تعليمية متنوعة لتوضيح المفاهيم الأساسية، مما ساعد الطلاب على رؤية العلاقة بين الأجزاء المختلفة من المادة.',
    link: 'https://docs.google.com/document/d/194aJJYo1QrA4udE90M5gHbcnd6FuMq1CqVEMDMKHJf4/edit',
  },
  {
    title: 'دوال Get & Set',
    date: '2023-10-03 / الحصة الثانية',
    content: 'في الحصة الثانية، تم توزيع الوقت بشكل جيد لضمان تغطية المواد ومنح الوقت الكافي للشرح والتفاعل. تم تحفيز الطلاب على التفكير النقدي وتطوير مشاريع إبداعية، مع تشجيعهم على تطوير مهارات العمل والتعلم الذاتي. في نهاية الدرس، قدم المعلم مراجعة شاملة وملخصة للمواد وتم تقييم مدى تحقيق الأهداف التعليمية من خلال النقاش وطرح الأفكار.',
    link: 'https://docs.google.com/document/d/194aJJYo1QrA4udE90M5gHbcnd6FuMq1CqVEMDMKHJf4/edit',
  },
  {
    title: 'Excel ',
    date: '2023-10-04 / الحصة الأولى',
    content: 'قدم الأستاذ فادي درسًا حول تصميم مشروع في عالم البيانات والرسوم البيانية لطلاب الصف العاشر. اعتمد الدرس على التعلم الذاتي باستخدام أدوات تحليل البيانات وإنشاء الرسوم البيانية، مع تقديم الدعم والإرشاد عند الحاجة. شجع المعلم الطلاب على تطوير مهارات البحث وتقديم المشاريع، مما عزز التفاعل الإيجابي وروح المبادرة في الصف.',
    link: 'https://docs.google.com/document/d/1l-HELdimiybDae4bGC5vvg0jLqyCq6woiO6UnRBh2mQ/edit',
  },
  {
    title: '#C',
    date: '2023-10-12 / Meet: 45m',
    content: 'قدم المعلم أحمد اغبارية درسًا لطلاب الصف الحادي عشر عبر Google Meet، ركز على تحسين المهارات في النسبة المئوية والمعادلة التربيعية. استخدم الدرس تمارين تفاعلية وحلول متنوعة، وشجع المشاركة الفعالة من الطلاب. في نهاية الدرس، أعطى المعلم مهام بيتيه لتقييم تحقيق الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/1NK8pch0JGBElUYIAntLcAAFGwrr_PPW_5j6iTXggte8/edit',
  },
  {
    title: 'مقدمة إلى Stack',
    date: '2023-10-17 / Meet: 45m',
    content: 'قدم المعلم مهند محاميد درسًا عبر Google Meet لطلاب الصف الحادي عشر حول الـ Stack، مع تسليط الضوء على سلسلة Fibonacci. استخدم وسائل تعليمية حديثة وطرق تدريس متنوعة لتشجيع المشاركة. تم تعزيز حب الاستطلاع من خلال دمج جوانب إبداعية وتقديم التحديات. أظهر المعلم تمكنًا من المادة ودقة في الشرح، وشجع على المشاركة الفعالة، مع مهام بيتية لتقييم الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/1-x9Gq_3-eJmnAQo_UV9bT0kzPcvydNjHPn0S9xo6Lc8/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-10-19 / Meet: 45m ',
    content: 'قدم المعلم أحمد اغبارية درسًا عبر Google Meet لطلاب الصف الحادي عشر حول "מודלים חישוביים" (نماذج حسابية). بدأ الدرس بمقدمة جذابة وشرح المفاهيم الرئيسية باستخدام مصادر تعليمية من الجامعة المفتوحة. تم تنظيم الموضوع بشكل تسلسلي ومنطقي مع تشجيع الطلاب على المشاركة وطرح الأسئلة. أظهر المعلم تمكنًا عاليًا من المادة، واستخدم لغة واضحة ومنهج منظم، مما ساهم في تحقيق الأهداف التعليمية وتعزيز فهم الطلاب.',
    link: 'https://docs.google.com/document/d/1lRMyqZCjnkQ2Z7athbYiCa1LKe5gbNYJkl82M7w7CEo/edit',
  },
  {
    title: 'HTML & CSS',
    date: '2023-10-31 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا حول فهم مفهوم قواعد البيانات وأهمية استخدام Microsoft Access لطلاب الصف الثاني عشر. بدأ الدرس بتحديد أهدافه بوضوح، واستخدم تمارين عملية ورسوم توضيحية لتبسيط المفاهيم، مع إشراك الطلاب في مناقشات وتحليل حالات دراسية لتعزيز الفهم.',
    link: 'https://docs.google.com/document/d/1UA4_sJuHKqCu6zkiNQ1N25aZ_A9tT9r2LulO8Wbjgdc/edit',
  },
  {
    title: 'HTML & CSS',
    date: '2023-10-31 / الحصة الثانية',
    content: 'في الحصة الثانية، تم تقييم الطلاب من خلال أسئلة بعد كل شرح لضمان فهمهم للمادة. استخدم المعلم لغة مبسطة ومفهومة، وقدم دعمًا إضافيًا للطلاب المحتاجين. شجع المعلم على كسر حواجز القلق وتفاعل الطلاب بشكل مستمر. في نهاية الدرس، تمت مراجعة النقاط الرئيسية وتأكيد الأهداف المحققة، مع وضع مهام بيتية لتقييم مدى تحقيق الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/1UA4_sJuHKqCu6zkiNQ1N25aZ_A9tT9r2LulO8Wbjgdc/edit',
  },
  {
    title: 'Stack - Pop() & Push',
    date: '2023-10-31 / الحصة الثالثة',
    content: 'قدم المعلم مهند محاميد درسًا حول مفهوم هيكل البيانات (Stack) ودوره في تخزين البيانات لطلاب الصف الحادي عشر، مع التركيز على عمليتي الـ Pop() وPush(). بدأ الدرس بتوجيه أهدافه وتحفيز الطلاب باستخدام أمثلة وأسئلة تحفيزية، وتضمن الدرس تمارين عملية واستخدام تطبيقات عملية لتوضيح المفاهيم.',
    link: 'https://docs.google.com/document/d/1d9zGs26sdbu0ss1H17_Pd0eb9ZWORrwWd1ScXAbppek/edit',
  },
  {
    title: 'Stack - Pop() & Push',
    date: '2023-10-31 / الحصة الرابعة',
    content: 'في الحصة الرابعة، قدم المعلم شرحًا دقيقًا لعمليات الـ Pop() وPush()، مما ساعد في توضيح النقاط الرئيسية. تم تقييم الطلاب من خلال أسئلة بعد كل شرح لضمان فهمهم. في نهاية الدرس، تم استعراض النقاط الرئيسية ووضع مهام بيتية لتقييم تحقيق الأهداف التعليمية. أظهر المعلم تمكنًا عاليًا من المادة واستخدم لغة واضحة، مما ساهم في توفير بيئة تعليمية إيجابية.',
    link: 'https://docs.google.com/document/d/1d9zGs26sdbu0ss1H17_Pd0eb9ZWORrwWd1ScXAbppek/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-02 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا حول "מודלים חישוביים" (نماذج حسابية) لطلاب الصف الحادي عشر، مع تحديد أهداف تعليمية واضحة وجذابة. استخدم وسائل تعليمية متنوعة مثل الشروحات المرئية والأنشطة التفاعلية، وركز على كيفية التعامل مع نماذج الحساب لحل المسائل، مما ساعد في توفير بيئة تعليمية مناسبة.',
    link: 'https://docs.google.com/document/d/1Nirm4tT7iBbV02elAWb7EorfzkUTzQoHeItB0ixmqik/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-02 / الحصة الثانية',
    content: 'في الحصة الثانية، استخدم المعلم اللوح والشروحات المباشرة مع تطبيقات عملية للتمارين لتعزيز الفهم. تم تحفيز الطلاب على التفكير النقدي من خلال أسئلة تحفز الفضول، وتعزيز التفاعل والمشاركة الفعالة من خلال الأنشطة التعليمية المتنوعة. في نهاية الدرس، تم استعراض النقاط الرئيسية وتقييم الفهم من خلال مهام بيتية.',
    link: 'https://docs.google.com/document/d/1Nirm4tT7iBbV02elAWb7EorfzkUTzQoHeItB0ixmqik/edit',
  },
  {
    title: 'C# - OOP',
    date: '2023-11-02 / الحصة الثالثة',
    content: 'قدم المعلم أحمد اغبارية درسًا حول البرمجة بلغة #C وفهم أساسيات البرمجة الشيئية لطلاب الصف الحادي عشر. بدأ الدرس بتحديد الأهداف التعليمية بشكل واضح واستخدام شروحات تفاعلية وتمارين عملية لتعزيز الفهم. تم تقييم الطلاب بشكل دوري وضمان استيعابهم للمواد. في نهاية الدرس، تم تحفيز الطلاب على التفكير النقدي والبحث الإضافي في موضوعات #C المتقدمة، مما ساعد في تطوير مهاراتهم في البرمجة وفهم الأساسيات بشكل أفضل.',
    link: 'https://docs.google.com/document/d/1xGt_z3u9PjzZIqahDgEcNtXmpHvkB6joy_8o90-89ww/edit',
  },
  {
    title: 'C# - Microsoft Access',
    date: '2023-11-07 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا حول استخدام قواعد البيانات في Microsoft Access ودمجها مع تطبيقات #C لطلاب الصف الثاني عشر. بدأ الدرس بتحديد أهداف واضحة واستخدم أمثلة واقعية وشروحات تفاعلية لشرح كيفية دمج Access مع #C، مما ساعد الطلاب على تطبيق المفاهيم في مواقف حقيقية.',
    link: 'https://docs.google.com/document/d/10ZT_sSFi-sHRl7NUOrXqd4gswzsD5Z6TlA2W06aoDRE/edit',
  },
  {
    title: 'C# - Microsoft Access',
    date: '2023-11-07 / الحصة الثانية',
    content: 'في الحصة الثانية، تم تنظيم الصف والمناخ التعليمي بشكل يسهل على الطلاب التركيز والانخراط في النقاشات. تم تحفيز الطلاب على التفكير النقدي واستكشاف كيفية تطبيق المفاهيم في الحياة العملية باستخدام وسائل تعليمية متنوعة مثل الرسوم التوضيحية والتمارين العملية. تم تقييم الأهداف التعليمية من خلال مشاريع عملية أو تمارين تطبيقية، مع تقديم توصيات لتحسين الأداء التعليمي.',
    link: 'https://docs.google.com/document/d/10ZT_sSFi-sHRl7NUOrXqd4gswzsD5Z6TlA2W06aoDRE/edit',
  },
  {
    title: 'Stack ',
    date: '2023-11-07 / الحصة الثالثة',
    content: 'قدم المعلم مهند محاميد درسًا حول استخدام وتنفيذ بنية البيانات Stack في لغة البرمجة C# لطلاب الصف الحادي عشر، مع التركيز على فهم العمليات الأساسية مثل Pop() وPush(). بدأ الدرس بتحديد أهدافه بشكل واضح واستخدم شروحات مباشرة وتطبيقات عملية لشرح النظرية وتوضيح أهمية استخدام الـ Stack في البرمجة.',
    link: 'https://docs.google.com/document/d/1qOdPsyRlCmAUKZ5KyDhz6wWi7MiVHCLLC_hNpyURX1Q/edit',
  },
  {
    title: 'Stack ',
    date: '2023-11-07 / الحصة الرابعة',
    content: 'في الحصة الرابعة، تم تنظيم الصف والمناخ التعليمي بشكل يتيح للطلاب التركيز والتفاعل الفعال. استخدم المعلم شرائح توضيحية وأمثلة تطبيقية لتوضيح بنية الـ Stack وكيفية استخدامها في C#. تم تقييم فهم الطلاب من خلال أسئلة ومراجعات مستمرة، مع تقديم مشاريع عملية أو تمارين تطبيقية لتقييم مدى تحقيق الأهداف التعليمية.',
    link: 'https://docs.google.com/document/d/1qOdPsyRlCmAUKZ5KyDhz6wWi7MiVHCLLC_hNpyURX1Q/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-09 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا لطلاب الصف الحادي عشر حول فهم أنواع الموديلات الحسابية، مثل النماذج الرياضية والنماذج الحسابية الأخرى. بدأ الدرس بتحديد الأهداف التعليمية بوضوح واستخدم أمثلة تطبيقية لشرح المفاهيم بطريقة بسيطة. افتتح الدرس بمثال عملي يوضح كيفية استخدام الموديلات الحسابية في الحياة اليومية، مما جذب انتباه الطلاب.',
    link: 'https://docs.google.com/document/d/1MCLzDKDKtdTy-BjgaWG_4Im7yN4tvCGz9EPgyMv2hfk/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-09 / الحصة الثانية',
    content: 'في الحصة الثانية، استخدم المعلم وسائل تعليمية متنوعة مثل الشرائح التوضيحية والأمثلة التطبيقية لشرح أنواع الموديلات الحسابية واستخداماتها. تم تحفيز الطلاب على استكشاف تطبيقات عملية للموديلات الحسابية من خلال أمثلة متنوعة، وتشجيعهم على التفكير النقدي. تم تقييم فهم الطلاب من خلال أسئلة وتمارين تطبيقية، مع توفير الدعم المناسب لكل طالب.',
    link: 'https://docs.google.com/document/d/1MCLzDKDKtdTy-BjgaWG_4Im7yN4tvCGz9EPgyMv2hfk/edit',
  },
  {
    title: 'Excel',
    date: '2023-11-09 / الحصة الرابعة',
    content: 'قدم الأستاذ فادي درسًا لطلاب الصف الحادي عشر حول كيفية استخدام أدوات Excel الأساسية مثل التنسيق، الصيغ، وإنشاء الرسوم البيانية لتحليل البيانات وعرضها بفعالية. بدأ الدرس بشرح أهمية Excel في الحياة اليومية والأعمال، واستخدم عروض تقديمية، أمثلة عملية، وتمارين تفاعلية لتوضيح كيفية استخدام Excel. تم تحفيز الطلاب على استكشاف مزيد من الإمكانيات في Excel من خلال أسئلة تفاعلية وأمثلة إضافية، مع تعزيز مهارات التعلم الذاتي والعمل الجماعي.',
    link: 'https://docs.google.com/document/d/1igGMJz8SehJ19G8CzgU75UKH5Fhm3LIAtU2XqvuCqoY/edit',
  },
  {
    title: 'SQL & Microsoft Access',
    date: '2023-11-14 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا لطلاب الصف الثاني عشر حول كيفية الولوج إلى قاعدة بيانات Microsoft Access واستخراج المعلومات باستخدام لغة البرمجة #C. بدأ الدرس بشرح أهمية قواعد البيانات في التطبيقات البرمجية وأهمية التكامل بين #C وMicrosoft Access. تم تقديم مثال عملي يوضح كيفية الربط بينهما، مما جذب انتباه الطلاب.',
    link: 'https://docs.google.com/document/d/1DkMWjkMaEmk2_CCWylr1vFsMDJll_S_2TieGnf21f-E/edit',
  },
  {
    title: 'SQL & Microsoft Access',
    date: '2023-11-14 / الحصة الثانية',
    content: 'في الحصة الثانية، استخدم المعلم شروحات فيديو، عروض تقديمية، وكود برمجي مباشر لتوضيح كيفية الولوج إلى قاعدة البيانات وتنفيذ استعلامات SQL. تم تحفيز الطلاب على طرح الأسئلة والاستكشاف من خلال أمثلة واقعية وتطبيقات عملية. تم تلخيص النقاط الرئيسية واستعراض خطوات تنفيذ الاستعلامات على قاعدة البيانات وعرض النتائج في تطبيق #C.',
    link: 'https://docs.google.com/document/d/1DkMWjkMaEmk2_CCWylr1vFsMDJll_S_2TieGnf21f-E/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-16 / الحصة الأولى',
    content: 'قدم المعلم أحمد اغبارية درسًا لطلاب الصف الحادي عشر حول استخدام وتحليل النماذج الحسابية مثل الآلات المحدودة والآلات التامة. بدأ الدرس بمثال حقيقي يوضح كيفية استخدام النماذج الحسابية في الحياة العملية، واستخدم العروض التقديمية، الرسوم البيانية، والأمثلة العملية لشرح الأنواع المختلفة من النماذج الحسابية وكيفية تطبيقها.',
    link: 'https://docs.google.com/document/d/1FAyxvOHkLRmqyitXhNvyL7f9VUQAcdcKkp-8TnveYPY/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-16 / الحصة الثانية',
    content: 'في الحصة الثانية، تم تحفيز الطلاب على طرح الأسئلة واستكشاف تطبيقات النماذج الحسابية في مجالات مختلفة. استخدم المعلم استراتيجيات تحفيزية مثل الثناء على المشاركة الفعالة وتقديم تحديات لتعزيز التفكير النقدي. تم تلخيص النقاط الرئيسية في نهاية الدرس من خلال تمرين عملي يستخدم نماذج حسابية لحل مشكلة محددة.',
    link: 'https://docs.google.com/document/d/1FAyxvOHkLRmqyitXhNvyL7f9VUQAcdcKkp-8TnveYPY/edit',
  },
  {
    title: 'מודלים חישוביים',
    date: '2023-11-16 / الحصة الثالثة',
    content: 'في الحصة الثالثة، تم تقييم فهم الطلاب من خلال اختبارات قصيرة وتمارين تطبيقية تتطلب استخدام النماذج الحسابية في مواقف مختلفة. استخدم المعلم مصادر متنوعة لتوضيح المفاهيم ودعم التعلم الذاتي، وعزز مهارات العمل الجماعي والتعلم الذاتي من خلال تمارين تطبيقية ومشاريع تعاونية.',
    link: 'https://docs.google.com/document/d/1FAyxvOHkLRmqyitXhNvyL7f9VUQAcdcKkp-8TnveYPY/edit',
  },
  {
    title: 'أساسيات الـ #C',
    date: '2023-11-16 / الحصة الخامسة',
    content: 'قدم المعلم مهند محاميد درسًا لطلاب الصف العاشر حول كيفية تعريف واستخدام المتغيرات في لغة البرمجة #C، واستخدام Console لعرض وإدخال البيانات. بدأ الدرس بشرح أهمية المتغيرات في البرمجة، واستخدم مثالاً بسيطاً يوضح كيفية تعريف متغير وطباعة قيمته باستخدام Console. استخدم المعلم عروض تقديمية وشروحات فيديو وأمثلة عملية، وتم تنفيذ تطبيق عملي حيث كتب الطلاب برامج قصيرة تتضمن تعريف المتغيرات واستخدام Console لطباعة النصوص والقيم. كان هناك تفاعل جيد بين الطلاب والمعلم، وتم تقييم فهم الطلاب من خلال تمارين تطبيقية واختبارات قصيرة.',
    link: 'https://docs.google.com/document/d/19qi1meSIkbEyrjtLihe4KaBwNl-wyW3bMvZdyvoWYLc/edit',
  },
];

const Observations = () => {
  return (
    <ObservationsContainer>
      {docs.map((doc, index) => (
        <DocCard
          key={index}
          title={doc.title}
          date={doc.date}
          content={doc.content}
          link={doc.link}
          image={doc.image}
        />
      ))}
    </ObservationsContainer>
  );
};

export default Observations;
