import React from "react";
import LayoutWithImage from "./LayoutWithImage";
import Signature from "./Signature";
import overviewImg from "../../imgs/overview.jpg";

const Overview = () => {
  const text = `
مع بداية العام الدراسي في كلية القاسمي، كنت متحمسًا لاستكشاف التعليم من منظور عملي، مستفيدًا من المناهج المتقدمة والمحاضرين المتميزين. كانت هذه الفترة مليئة بالتحديات والفرص، مما أتاح لي تطوير مهاراتي في مجال علوم الحاسوب والتربية غير المنهجية. تعلمت أن التعليم ليس مجرد نقل المعرفة، بل هو فن يتطلب التفاني والابتكار، وشاركت في أنشطة أكاديمية ولامنهجية متنوعة لتعزيز فهم الطلاب بشكل عملي وممتع. رغم التحديات في إدارة الوقت والتعامل مع طلاب بمستويات فهم مختلفة، أدركت أن النجاح يأتي من القدرة على التكيف والتعلم من كل تجربة. هذا العام الدراسي كان تجربة تحويلية جعلتني أدرك أن التعليم هو رسالة سامية تتطلب الشغف والإبداع. أشعر بالامتنان لكلية القاسمي ولمعلمي وللمرشدين، وأتطلع إلى مواصلة هذه الرحلة وتحقيق المزيد من النجاحات في المستقبل. "في المدارس نتعلم الدروس لنقدم الامتحانات, اما في الحياة نعيش المحن لنتعلم الدروس"  `;

  return (
    <LayoutWithImage
      photoUrls={[overviewImg]}
      text={text}
      signature={<Signature />}
    />
  );
};

export default Overview;
