import React from 'react';
import LayoutWithImage from './LayoutWithImage';
import Signature from './Signature';
import Section from './Section';
import ScrollArrow from './ScrollArrow';
import summaryImg from '../../imgs/summary.jpg';
import { FaComments } from 'react-icons/fa';
import { FaFlagCheckered } from 'react-icons/fa';


import {
  FaArrowAltCircleUp,
  FaRegComment,
  FaRegCommentDots,
  FaRegListAlt,
  FaRegMeh,
  FaRegSadTear,
  FaRegStar,
} from 'react-icons/fa';

const sections = [
  {
    id: 'feel-section',
    icon: <FaRegMeh size={30} />,
    title: 'أشعر بـ',
    text: `
أشعر أن تجربتي في التطبيقات العملية قد ساهمت بشكل كبير في تعزيز معرفتي التربوية وزيادة وعيي بأهمية الدور الذي يلعبه المعلم في حياة الطلاب. خلال هذه الفترة، واجهت تحديات متعددة، ولكنها كانت فرصًا ثمينة للتعلم والنمو. أدركت أن التعليم ليس مجرد نقل للمعرفة، بل هو عملية تفاعلية تتطلب الصبر، والمرونة، والإبداع. أصبحت أكثر وعيًا بأهمية بناء علاقة إيجابية مع الطلاب وفهم احتياجاتهم الفردية. هذه التجربة زودتني بأدوات قيمة لمواصلة تطوير مهاراتي والعمل على تحسين الجوانب التي تحتاج إلى تعزيز، مما يعزز من قدرتي على التأثير الإيجابي في حياة الطلاب والمساهمة في تحقيق أهدافهم التعليمية.    `,
  },
  {
    id: 'id2',
    icon: <FaRegSadTear size={30} />,
    title: 'نقاط ضعف',
    text: `
 أحيانًا أجد صعوبة في توزيع الوقت بشكل فعال بين الأنشطة المختلفة.
 أحتاج إلى تطوير استراتيجيات أكثر فعالية للتعامل مع سلوكيات الطلاب المتنوعة داخل الصف.
 أرغب في تحسين مهاراتي في تقييم أداء الطلاب بشكل أكثر دقة وموضوعية.    `,
  },
  {
    id: 'id3',
    icon: <FaRegStar size={30} />,
    title: 'نقاط قوة',
    text: `
أتمتع بعدة نقاط قوة ساعدتني في تحقيق النجاح خلال فترة التطبيقات:
لدي قدرة جيدة على بناء علاقات إيجابية مع الطلاب وتشجيعهم على المشاركة والتفاعل.
أستخدم أساليب تدريس مبتكرة تجعل الدروس أكثر جاذبية وتفاعلية.
أستطيع التكيف مع الظروف المختلفة والتعامل مع المواقف غير المتوقعة بكفاءة.    `,
  },
  {
    id: 'id4',
    icon: <FaRegListAlt size={30} />,
    title: 'أشياء أود فعلها',
    text: `
هناك بعض الأمور التي أود تحقيقها في المستقبل لتعزيز تجربتي التربوية:
 أود تعلم تقنيات وأساليب تعليمية جديدة لتعزيز تجربة التعليم.
أطمح للمشاركة في ورش عمل ودورات تدريبية لزيادة معرفتي التربوية.
أرغب في تعزيز التعاون مع زملائي المعلمين لتبادل الخبرات والأفكار.    `,
  },
  {
    id: 'id5',
    icon: <FaArrowAltCircleUp size={30} />,
    title: 'أشياء أود تحسينها',
    text: `
أرغب في تحسين بعض الجوانب في عملي لتقديم أفضل تجربة تعليمية للطلاب:
 تحسين مهاراتي في توزيع الوقت بين الأنشطة الدراسية واللامنهجية.
 تحسين مهاراتي في توزيع الوقت بين الأنشطة الدراسية واللامنهجية.
 تحسين مهاراتي في تقديم تغذية راجعة بناءة للطلاب وتقييم أدائهم بشكل دقيق.    `,
  },
  {
    id: 'id6',
    icon: <FaRegCommentDots size={30} />,
    title: 'ملاحظات المعلم المدرب',
    text: `
قدم لي المعلم المدرب عدة ملاحظات بناءة لتحسين أدائي:
ضرورة التركيز على التفاصيل الصغيرة في التخطيط والتنفيذ.
الحفاظ على تفاعل إيجابي ومستمر مع الطلاب.
الاستمرار في تطوير مهاراتي التربوية من خلال التعلم المستمر والمشاركة في الأنشطة التدريبية.    `,
  },
  {
    id: 'id7',
    icon: <FaRegComment size={30} />,
    title: 'ملاحظات المرشد',
    text: `
أهمية التحلي بالصبر والتحمل في التعامل مع التحديات الصفية.
تشجيعي على استخدام أساليب مبتكرة وجديدة في التدريس لجذب اهتمام الطلاب.
اهمية ان تكون الافتتاحية قصيرة ومختصرة لكي لا يشعر الطلاب بالملل    `,
  },
  {
    id: 'id8',
    icon: <FaComments size={30} />,
    title: 'تغذية مرتدة',
    text: `
تلقيت تغذية راجعة بناءة من الطلاب والمعلمين الذين تعاملت معهم، والتي ساعدتني في التعرف على نقاط القوة والضعف في أدائي. سأستمر في استخدام هذه التغذية الراجعة لتحسين مهاراتي وتقديم تجربة تعليمية أفضل للطلاب في المستقبل.  `,
  },
  {
    id: 'id9',
    icon: <FaFlagCheckered size={30} />,
    title: 'الختام',
    text: `كانت فترة التطبيقات العملية تجربة غنية ومليئة بالتحديات التي ساهمت في تطوير مهاراتي التربوية. استفدت كثيرًا من ملاحظات المعلم المدرب والمرشد، وأشعر بالامتنان للدعم والتوجيه الذي تلقيته. أتطلع إلى الاستمرار في تحسين أدائي ومواصلة رحلتي التعليمية بنجاح.   `,
  },
];

const Summary = () => {
  return (
    <div>
      <LayoutWithImage photoUrls={[summaryImg]} text={sections[0].text} signature={<Signature />} />
      <ScrollArrow targetId="feel-section" />
      {sections.map((section, index) => (
        <Section
          id={section.id}
          key={index}
          icon={section.icon}
          title={section.title}
          date={section.date}
          text={section.text}
          links={section.links}
        />
      ))}
    </div>
  );
};

export default Summary;
